c
c Copyright (c) 1996-2004 by Gennady Serdyuk.  All rights reserved.
c gserdyuk@mail.ru
c 
c Released under GPL v 2.0
c




        SUBROUTINE LENA
C ***
C *** πPOηPAMMA σοδεςφιτ νAσσιχ "A"
C ***
C
C
      IMPLICIT DOUBLE PRECISION (A-H,O-Z)
       COMMON/BLKA/    A,KA
       COMMON/BLIFF/IFF(7,4),KIFF,NNIFF(4,8),KNNIFF,PNIFF(8),FNE1,FNE2
      CHARACTER*4 FNE1,FNE2
C
C
C      MACCιB "A" ρBμ. ϊAηOTOBKOκ δμρ ζOPMιP. "MPOINT"
       INTEGER*4   A (20,50)
C                         KA - MAKC. KOμ-BO TιπOB όμEMEHTOB
      DATA A/
     +4HR   ,4H    ,4H    ,4H    ,0,1, 5,2,0,0,1,0, 1,0,0,0,0,0,0,0, 
     +4HL   ,4H    ,4H    ,4H    ,0,1, 5,2,0,0,1,0, 1,0,0,0,0,0,0,0,
     +4HC   ,4H    ,4H    ,4H    ,0,1, 5,2,0,0,1,0, 1,0,0,0,0,0,0,0, 
     +4HE   ,4H    ,4H    ,4H    ,0,2,10,2,0,0,1,0, 4,0,0,0,0,0,0,2, 
     +4HJ   ,4H    ,4H    ,4H    ,0,2,10,2,0,0,1,0, 4,0,0,0,0,0,0,2, 
     +4HP2  ,4H    ,4H    ,4H    ,0,2,10,2,0,0,1,0, 7,0,0,0,0,0,0,2, 
     +4HVD  ,4HSCHT,4H    ,4H    ,0,3,10,3,1,0,2,0, 8,0,0,0,0,1,1,0, 
     +4HGN  ,4HLIN ,4H    ,4H    ,0,3, 9,2,0,0,1,0, 1,0,0,0,0,1,1,0, 
     +4HGN  ,4HPOLY,4H    ,4H    ,0,3, 9,2,0,0,1,0, 7,0,0,0,0,1,1,0, 
     +4HGN  ,4HJUNC,4H    ,4H    ,0,3, 9,2,0,0,1,0, 4,0,0,0,0,1,1,0, 
     +4HFET ,4HCURT,4H    ,4H    ,0,3,13,6,3,0,1,0,17,0,0,0,0,2,2,0, 
     +4HICU ,4HJUNC,4H    ,4H    ,0,3,11,4,0,0,1,0, 5,0,0,0,0,1,1,0, 
     +4HICU ,4HPOLY,4H    ,4H    ,0,3,11,4,0,0,1,0, 7,0,0,0,0,1,1,0, 
     +4HCN  ,4HDIFF,4H    ,4H    ,0,3, 9,2,0,0,1,0, 5,0,0,0,0,2,2,0, 
     +4HCN  ,4HBARR,4H    ,4H    ,0,3, 9,2,0,0,1,0, 4,0,0,0,0,2,2,0, 
     +4HCN  ,4HLIN ,4H    ,4H    ,0,3, 9,2,0,0,1,0, 1,0,0,0,0,2,2,0, 
     +4HCN  ,4HPOLY,4H    ,4H    ,0,3, 9,2,0,0,1,0, 7,0,0,0,0,2,2,0, 
     +4HLIB0,4HLL0 ,4H    ,4H    ,0,2,12,4,0,0,1,0, 2,0,0,0,0,0,0,0, 
     +4HYTAB,4H    ,4H    ,4H    ,0,5, 0,0,0,0,1,0, 0,0,0,0,0,0,0,1, 
     +4HSTAB,4H    ,4H    ,4H    ,0,5, 0,0,0,0,1,0, 0,0,0,0,0,0,0,1, 
     +4HLIB ,4HMPL ,4H    ,4H    ,0,2,12,4,0,0,2,0, 7,0,0,0,0,0,0,0, 
     +4HLIB ,4HLANG,4H    ,4H    ,0,2,12,4,0,0,2,0,12,0,0,0,0,0,0,0, 
     +4HLIB ,4HSMPL,4H    ,4H    ,0,2,12,4,0,0,2,0,11,0,0,0,0,0,0,0, 
     +4HBIP ,4HTR  ,4H    ,4H    ,0,3,14,7,4,0,1,0,23,0,0,0,0,2,2,0, 
     +4HSHL ,4HKZ  ,4H    ,4H    ,0,2,10,2,0,0,2,0, 3,0,0,0,0,0,0,0, 
     +4HSHL ,4HXX  ,4H    ,4H    ,0,2,10,2,0,0,2,0, 3,0,0,0,0,0,0,0,
     +4HDISC,4H    ,4H    ,4H    ,0,2,10,2,0,0,2,0, 3,0,0,0,0,0,0,0,
     +4HINDS,4H    ,4H    ,4H    ,0,2,14,6,0,0,1,0,12,0,0,0,0,0,0,0, 
     +440*0/
C
C      πςι χχεδεξιι ξοχοηο τιπA όμενεξτοχ ξεοβθοδινο χξεστι δοπομξεξιρ
C      χ ιξστςυλγιΰ INSTIL.TXT ( ποδδιςελτοςικ YINSTR ) ι χ CHAPTER5.REP
C      (ποδδιςελτοςικ REPORT)
C
C      τιπω όμενεξτοχ ,4HBIP TR, 'SHL KZ, 'SHL XX'
C      πολα ξε ισπομψϊυΰτσρ (ιμι υφε ξε ισπομψϊυΰτσρ).
C
      KA=28
C
C   ϊαπομξεξιε νασσιχα 'A'
C     A(1) ... A(4) - ξαϊχαξιε τιπα όμενεξτα;
C     A(6) - πςιϊξαλ οπςεδεμρΰύικ τιπ όμενεξτα:
C              μιξεκξωκ δχυθπομΰσξιλ -  1,
C              μιξεκξωκ νξοηοπομΰσξιλ - 2,
C              ξεμιξεκξωκ όμενεξτ - 3,
C              Y-, S-νατςιγω - 5.
C     A(7) - δμιξα στςολι οπισαξιρ οδξοηο όμενεξτα
C            δαξξοηο τιπα χ "NODEEL":
C              δμρ μιξεκξωθ δχυθπομΰσξιλοχ - 5,
C              δμρ μιξεκξωθ νξοηοπομΰσξιλοχ - 8+λομιώεστχο χξεϋ. υϊμοχ,
C              δμρ ξεμιξεκξωθ όμενεξτοχ - 7+λομιώεστχο χξεϋ. υϊμοχ
C              δμρ Y-, S-νατςιγ - 0.
C     A(8) - λομιώεστχο υϊμοχ χ νατενατιώεσλοκ νοδεμε
C            (χξεϋξιε+χξυτςεξξιε):
C              δμρ μιξεκξωθ δχυθπομΰσξιλοχ - 2,
C              δμρ μιξεκξωθ νξοηοπομΰσξιλοχ - 0, τ.λ. ότο ϊξαώεξιε
C              οπςεδεμρετσρ δμρ λαφδοηο μιξ. νξοηοπομΰσξιλα αχτονατιώεσλ
c     ι,
C              δμρ ξεμιξεκξωθ όμενεξτοχ - λομ-χο υϊμοχ,
C              δμρ Y-, S-νατςιγ - 0.
C    A(9) - λομιώεστχο χξυτςεξξιθ υϊμοχ, αχτονατιώεσλι ξυνεςυενωθ
C           πςι οπισαξιι υϊμοχ χλμΰώεξιρ όμενεξτα.
C    A(11) - λομιώεστχο παςανετςοχ οβύιθ δμρ δαξξοηο τιπα (εσμι παςανετς
c     ω
C            οτσυτσχυΰτ, το ξεοβθοδινο ϊαξεστι 1).
C    A(13) - λομιώεστχο ιξδιχιδυαμψξωθ παςανετςοχ, οπισωχαΰύι
C            νατενατιώεσλυΰ νοδεμψ όμενεξτα.
C    A(18) - δμρ ξεμιξεκξωθ όμενεξτοχ ϊαξοσιτσρ ναλσιναμψξ
C            λομιώεστχο χθοδξωθ χεμιώιξ πςι ςασώετε τολα.
C    A(19) - δμρ ξεμιξεκξωθ όμενεξτοχ ϊαξοσιτσρ ναλσιναμψξ
C            λομιώεστχο χωθοδξωθ χεμιώιξ πςι ςασώετε τολα.
C
C
C  όμενεξτ τιπα "R"        ςεαμιϊοχαξ π/π LIN2P         (ΖΑΚΜ FORMER)
C  όμενεξτ τιπα "L"        ςεαμιϊοχαξ π/π LIN2P         (ΖΑΚΜ FORMER)
C  όμενεξτ τιπα "C"        ςεαμιϊοχαξ π/π LIN2P         (ΖΑΚΜ FORMER)
C  όμενεξτ τιπα "E"        ςεαμιϊοχαξ π/π EMF           (ΖΑΚΜ LIBLIN)
C  όμενεξτ τιπα "J"        ςεαμιϊοχαξ π/π JDRFE         (ΖΑΚΜ LIBLIN)
C  όμενεξτ τιπα "P2"       ςεαμιϊοχαξ π/π RFFIPN        (ΖΑΚΜ LIBLIN)
C  όμενεξτ τιπα "VD SCHT"  ςεαμιϊοχαξ π/π MDSCH1-MDSCH6 (ΖΑΚΜ MDSCH)
C  όμενεξτ τιπα "GN LLIN"  ςεαμιϊοχαξ π/π LIN1-LIN5     (ΖΑΚΜ LIN)
C  όμενεξτ τιπα "GN POLY"  ςεαμιϊοχαξ π/π POLY51-POLY55 (ΖΑΚΜ POLY5)
C  όμενεξτ τιπα "GN JUNC"  ςεαμιϊοχαξ π/π JUNC1-JUNC6   (ΖΑΚΜ JUNC)
C  όμενεξτ τιπα "FET CURT" ςεαμιϊοχαξ π/π CURT1-CURT6   (ΖΑΚΜ CURT)
C  όμενεξτ τιπα "ICU JUNC" ςεαμιϊοχαξ π/π ICUJ1-ICUJ6   (ΖΑΚΜ ICUJUNC)
C  όμενεξτ τιπα "ICU POLY" ςεαμιϊοχαξ π/π ICUPL1-ICUPL5 (ΖΑΚΜ ICUPOLY)
C  όμενεξτ τιπα "CN DIFF"  ςεαμιϊοχαξ π/π CDIFF1-CDIFF6 (ΖΑΚΜ CDIFF)
C  όμενεξτ τιπα "CN BARR"  ςεαμιϊοχαξ π/π CBARR1-CBARR5 (ΖΑΚΜ CBARR)
C  όμενεξτ τιπα "CN LIN"   ςεαμιϊοχαξ π/π CLIN1-CLIN5   (ΖΑΚΜ CLIN)
C  όμενεξτ τιπα "CN POLY"  ςεαμιϊοχαξ π/π CPOLY1-CPOLY5 (ΖΑΚΜ CPOLY)
C  όμενεξτ τιπα "LIB0 LL0" ςεαμιϊοχαξ π/π LINE1,LINE2   (ΖΑΚΜ LIB0)
C  όμενεξτ τιπα "YTAB"     ςεαμιϊοχαξ π/π YTAB          (ΖΑΚΜ YTAB)
C  όμενεξτ τιπα "STAB"     ςεαμιϊοχαξ π/π STAB          (ΖΑΚΜ STAB)
C  όμενεξτ τιπα "LIB MPL"  ςεαμιϊοχαξ π/π MP            (ΖΑΚΜ MPL)
C  όμενεξτ τιπα "LIB LANG" ςεαμιϊοχαξ π/π LANG          (ΖΑΚΜ LANGE)
C  όμενεξτ τιπα "LIB SMPL" ςεαμιϊοχαξ π/π SMPL          (ΖΑΚΜ SMPL)
C  όμενεξτ τιπα "BIP TR"   ςεαμιϊοχαξ π/π BIPTR1-BIPTR5 (ΖΑΚΜ BIPTR)
C  όμενεξτ τιπα "SHL KZ"   ςεαμιϊοχαξ π/π SHLEIF        (ΖΑΚΜ SHLEIF)
C  όμενεξτ τιπα "SHL XX"   ςεαμιϊοχαξ π/π SHLEIF        (ΖΑΚΜ SHLEIF)
C  όμενεξτ τιπα "DISC"     ςεαμιϊοχαξ π/π DISCONT       (ΖΑΚΜ DISCONT)
C  όμενεξτ τιπα "INDS"     ςεαμιϊοχαξ π/π INDSV         (ΖΑΚΜ INDSV)
C
C
      DATA IFF/
     +4HP2  ,4H    ,4H    ,4H    ,2,0,0, 
     +4HP2  ,4H    ,4H    ,4H    ,5,0,0, 
     +4HE   ,4H    ,4H    ,4H    ,2,0,0, 
     +4HJ   ,4H    ,4H    ,4H    ,2,0,0
     +/

      DATA   KIFF/4/,   KNNIFF/0/
C
      RETURN
      END
